
print("-"*30)

# 변수 - 1개의 값을 저장하는 공간
# 복합변수 - 여러개의 값을 저장하는 공간
# 리스트 - 순서가 있음, 튜플 - 수정불가, 딕셔너리- 키값으로 존재, 셋- 중복불가

### 리스트
stus = ['홍길동',100,90,80,270,90.0]

# print("이름 : %s" % stus[0])
# print("평균 : %.1f" % stus[5])


# a_list = [1,3,5,7,9,11]
# # 7,11을 출력

# print(a_list[3])
# print(a_list[5])

# # 국어 : 100 출력

# print("국어 : %d" % stus[1])

# print("이름 :",stus[0],",국어 :", stus[1],",영어 :",stus[2],",수학 :",stus[3],",합계 :",stus[4],",평균 :",stus[5])

# print("이름 : %s, 국어 : %d, 영어 : %d, 수학 : %d, 합계 : %d, 평균 : %.1f" % (stus[0],stus[1],stus[2],stus[3],stus[4],stus[5]))

# print("이름 : %s, 국어 : %d, 영어 : %d, 수학 : %d, 합계 : %d, 평균 : %.1f" % *stus)  # 정계연산자


# a_list = [0,5,3,1,2,4,1,5,6]
# print("0번째 : %d, 2번째 : %d" % (a_list[0], a_list[2]))









print("-"*30)